unfdemo.BS_Billing/src/DataProcessors/bs_Заполнение/bs_Заполнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>bs_Заполнение</name>
  <attributes>
    <name>token</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контргаенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

unfdemo.BS_Billing/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d31edcfb-c254-4df6-813c-45d97556c9a4">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>bs_IDГРМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6a614d71-f1bf-4633-927f-fd1ab375a540">
    <name>ВидКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbfd1e4e-302d-4158-a36e-7de2ee52275f">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="150ea83f-859a-4383-a7e2-add9615c515d">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5466e60d-3f3b-4854-8bc4-fe713678faf2">
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a66e61d-1e1f-42eb-84c7-96c67491221a">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83abc3c8-5d30-4200-9b3c-c098e93d9dd4">
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2371825-a31d-415b-8866-8e1c4f108e47">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="578aaecc-aed2-4ef8-88f9-128a6e803783">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="854ddbe5-0bf2-4200-99b7-e7f1ddfc9a9f">
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="98a3a104-c023-42c2-a3c0-d21a8e8f0304">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0565ba91-4e56-4a4c-9e27-ac8d883651da">
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="659f6c35-8c2c-4875-b5cb-8ac72af650b4">
    <name>ВидГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2539e2b6-2cb7-41c5-8e5d-9974cf014a38">
    <name>КодГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fd18fe57-8dac-4f41-ba14-ab79115be357">
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dbf75569-7170-46ea-98a4-29bb3969c1c2">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7122d071-c81b-484d-974a-5395bce9e1e5">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41b066d1-5b7a-43b3-a41f-e1454f08da07">
    <name>ДокументУдостоверяющийЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dcd64d96-d03a-453f-9b38-c9fb1774f698">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1fc7846e-c92e-4119-9b0b-ab25f1a6447b">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7abf59d6-06a4-45fa-b1d0-bf469f93bc01">
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bffaa0c1-d082-4cef-bb60-629a5f7c83bf">
    <name>ИсточникПривлеченияПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c668625-cb13-4bde-bae0-9759ff1df43c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4bd3ecda-70e1-4a95-8164-e47939295eac">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec4ed95c-1f1d-4935-9318-2b9974ec88f0">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80bc655a-d926-42fc-b027-e9e0c125aff4">
    <name>СтатьяДДСПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b164d06e-e560-4c9a-a490-fb1bec54fb76">
    <name>ВестиРасчетыПоДоговорам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e7689556-bfc3-41aa-a6c2-fae4e917afdd">
    <name>ВестиРасчетыПоДокументам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76421bdf-3553-4920-b9b2-b9cca25e740f">
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd01f401-1241-4c4f-9e6d-5c8ef4ea683c">
    <name>ВестиУчетОплатыПоСчетам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89940d0d-bcf8-4eeb-bd2e-6d9d6b5110d0">
    <name>ВалютаРасчетовПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="289fa88c-0c40-46ed-a350-582ad572453e">
    <name>РасчетыВУсловныхЕдиницахПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f8460b3-4edc-494c-b668-547bba8b65f1">
    <name>СпособРазнесенияОплатыПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f23efb9-0af4-4fcc-879f-655e4106847d">
    <name>СпособЗачетаПредоплатыПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adb6110c-e022-4572-88ef-65dd4952fcbe">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>bs_СервисыКлиента</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСервиса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

unfdemo.BS_Billing/src/DataProcessors/bs_Заполнение/Forms/Форма/Module.bsl
&НаКлиенте
Процедура bs_СохранитьТокен(Команда)
	bs_СохранитьТокенНаСервере();
КонецПроцедуры

&НаСервере
Процедура bs_СохранитьТокенНаСервере()
	Константы.bs_token.Установить(Объект.token);
КонецПроцедуры

&НаКлиенте
Процедура bs_ЗаполнитьСправочникСервисов(Команда)

	Результат = bs_работаСAPIКлиент.ВызватьМетодAPIGET("/orders/services");
	
	bs_ОбработкаРезультатаВызовСервера.ОбработатьСервисы(Результат);

КонецПроцедуры

&НаКлиенте
Процедура bs_сопоставитьКлиентов(Команда)
	Результат = bs_работаСAPIКлиент.ВызватьМетодAPIGET("/customers");
	
	ОбработатьРезультатНаСервере(Результат)
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатНаСервере(Результат)
	Для Каждого Строка из Результат Цикл
		
		НайденныйКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Строка.inn);
		
			НовыйКонтрагент 			= Объект.Контргаенты.Добавить();
			НовыйКонтрагент.Контрагент 	= НайденныйКонтрагент.Ссылка;
			НовыйКонтрагент.id 			= Строка.id;	
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура bs_ЗаписатьID(Команда)
	bs_ЗаписатьIDНаСервере();
КонецПроцедуры

&НаСервере
Процедура bs_ЗаписатьIDНаСервере()
		Для Каждого Строка из Объект.Контргаенты Цикл
			КонтрагентОбъект = Строка.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.bs_IDГРМ = Строка.id;
			КонтрагентОбъект.Записать();
		КонецЦикла;
КонецПроцедуры
